In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

In [2]:
%%sql
use database db_project;

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.ProgrammingError) 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'database db_project' at line 1
[SQL: use database db_project;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [3]:
%%sql
show databases;

 * mysql+mysqlconnector://root:***@localhost/test
9 rows affected.

[('db_project',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('test',),
 ('uber',),
 ('world',)]

In [4]:
%%sql
use db_project;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [5]:
%%sql
CREATE TABLE CustomerTransactions (
    id INT PRIMARY KEY,
    login_device VARCHAR(50),
    customer_name VARCHAR(100),
    ip_address VARCHAR(20),
    product VARCHAR(100),
    amount DECIMAL(10, 2),
    is_placed BOOLEAN,
    is_viewed BOOLEAN,
    transaction_status VARCHAR(20)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [6]:
%%sql
INSERT INTO CustomerTransactions VALUES
(1, 'Mobile', 'Ravi', '192.168.1.1', 'Laptop', 50000.00, TRUE, FALSE, 'Completed'),
(2, 'Desktop', 'Priya', '192.168.1.2', 'Smartphone', 20000.00, TRUE, TRUE, 'Completed'),
(3, 'Tablet', 'Arjun', '192.168.1.3', 'Headphones', 1500.00, FALSE, TRUE, 'Failed'),
(4, 'Mobile', 'Meena', '192.168.1.4', 'Shoes', 2500.00, TRUE, FALSE, 'Completed'),
(5, 'Desktop', 'Karthik', '192.168.1.5', 'Watch', 5000.00, TRUE, TRUE, 'Completed'),
(6, 'Mobile', 'Sowmya', '192.168.1.6', 'Tablet', 15000.00, TRUE, TRUE, 'Completed'),
(7, 'Tablet', 'Ramesh', '192.168.1.7', 'Smartphone', 25000.00, FALSE, TRUE, 'Failed'),
(8, 'Desktop', 'Divya', '192.168.1.8', 'Laptop', 60000.00, TRUE, FALSE, 'Completed'),
(9, 'Mobile', 'Arun', '192.168.1.9', 'Smartwatch', 12000.00, TRUE, TRUE, 'Completed'),
(10, 'Tablet', 'Deepa', '192.168.1.10', 'Laptop', 55000.00, FALSE, FALSE, 'Pending');

 * mysql+mysqlconnector://root:***@localhost/test
10 rows affected.

[]

In [11]:
%%sql
select count(*) from CustomerTransactions where transaction_status = 'Completed' and product ='Laptop' ; #AND

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(2,)]

In [14]:
%%sql
select count(*) from CustomerTransactions where transaction_status = 'Completed' or product ='Smartphone' ; #OR

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.
0 rows affected.

[]

In [9]:
%%sql
select count(*) from CustomerTransactions where transaction_status not in('Failed','Pending') #NOT IN

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(7,)]

In [10]:
%%sql
select count(*) from CustomerTransactions where transaction_status  in('Failed','Pending') #IN

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(3,)]

In [15]:
%%sql
select sum(amount) as total_transaction from CustomerTransactions;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(Decimal('246000.00'),)]

In [16]:
%%sql
select min(amount) as min_transaction from CustomerTransactions; #ALIAS

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(Decimal('1500.00'),)]

In [17]:
%%sql
select max(amount) as max_transaction from CustomerTransactions;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(Decimal('60000.00'),)]

In [18]:
%%sql
select avg(amount) as avg_transaction from CustomerTransactions;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(Decimal('24600.000000'),)]

In [29]:
%%sql
select * from CustomerTransactions limit 5; #LIMIT WE NEED SET TO MINIMISE TO HII=GH DATA RUN

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[(1, 'Mobile', 'Ravi', '192.168.1.1', 'Laptop', Decimal('50000.00'), 1, 0, 'Completed'),
 (2, 'Desktop', 'Priya', '192.168.1.2', 'Smartphone', Decimal('20000.00'), 1, 1, 'Completed'),
 (3, 'Tablet', 'Arjun', '192.168.1.3', 'Headphones', Decimal('1500.00'), 0, 1, 'Failed'),
 (4, 'Mobile', 'Meena', '192.168.1.4', 'Shoes', Decimal('2500.00'), 1, 0, 'Completed'),
 (5, 'Desktop', 'Karthik', '192.168.1.5', 'Watch', Decimal('5000.00'), 1, 1, 'Completed')]

In [20]:
%%sql
select login_device, sum(amount) as total_revenue from CustomerTransactions group by login_device
#without GROUPING WE WILL GET ERROR HERE BECAUSE OF 1 NON AGGREGATE VALUE(LOGIN_DEVICE) AND AGGREGATE VALUE (SUM(AMOUNT))

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('Mobile', Decimal('79500.00')),
 ('Desktop', Decimal('85000.00')),
 ('Tablet', Decimal('81500.00'))]

In [21]:
%%sql
select login_device, 
SUM(amount) AS total_revenue
from CustomerTransactions
group by login_device
HAVING 
sum(amount) > 80000; #here we think of wherE but having only  accept aggregate function like sum(amount) WHERE ACCEPT ONLY NON AGGREGATE VALUE LIKE AMOUNT

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[('Desktop', Decimal('85000.00')), ('Tablet', Decimal('81500.00'))]

In [ ]:
#CASE WHEN BETWEEN THEN ELSE END

In [22]:
%%sql
CREATE TABLE CustomerData (
    id INT PRIMARY KEY,
    customer_name VARCHAR(100),
    email VARCHAR(100),
    phone_number VARCHAR(15),
    address VARCHAR(200),
    amount DECIMAL(10, 2)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [23]:
%%sql
INSERT INTO CustomerData VALUES
(1, 'Ravi', 'ravi@example.com', '98765', 'Chennai', 5000.00),
(2, 'Priya', NULL, '98765', 'Bangalore', NULL),
(3, 'Arjun', 'arjun@example.com', NULL, 'Hyderabad', 1500.00),
(4, 'Meena', NULL, NULL, 'Mumbai', 2500.00),
(5, 'Karthik', 'karthik@example.com', '98765', NULL, 3000.00);

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[]

In [26]:
%%sql
select customer_name,amount, 
case #CASE
    when amount > 4000 then 'high spender'
    when amount between 2000 and 4000 then 'medium spender'
    when amount <=2000 then 'low spender'
    else 'no data'
    end as spender_category
from CustomerData

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[('Ravi', Decimal('5000.00'), 'high spender'),
 ('Priya', None, 'no data'),
 ('Arjun', Decimal('1500.00'), 'low spender'),
 ('Meena', Decimal('2500.00'), 'medium spender'),
 ('Karthik', Decimal('3000.00'), 'medium spender')]

In [27]:
%%sql
select customer_name,amount,
case
    when email is null and phone_number is null then '9999'
    when phone_number is null then email
    else phone_number
    end as contact
from CustomerData

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[('Ravi', Decimal('5000.00'), '98765'),
 ('Priya', None, '98765'),
 ('Arjun', Decimal('1500.00'), 'arjun@example.com'),
 ('Meena', Decimal('2500.00'), '9999'),
 ('Karthik', Decimal('3000.00'), '98765')]